


/* https://www.youtube.com/watch?v=UsezbK-3BL0&t=60s /
// лекция на Simple Code 
// про перегрузку операторов сравнения на примере == и !=
(остальные > < >= => по аналогии)




/* 
Перегрузка оператора равенства == и не равно !=. 
Перегрузка логических операторов сравнения. 
C++ #84
*/

#include <iostream>
#include <string>

/*

к дню 02 упр00 по ++

Нужно дописать код из урока (взять пример француза)

Перегрузка оператора - это авторская реализация оператора (любого) под свои типы данных
(которые компилятор не сможет реализовать через свои встроенные функции перегрузок
операторов)
ПО сути это предоставление программистру права переделать операторы (например + или -)
под свое видение (но это работа только с типами данных которые сам программер создавал)

this -> n (= это lhs left hand side operator)
а то что подается в функцию является rhs

пример дописать из видео
*/


