/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1002-1Sozdanie_Zapoln_Massiva.cpp                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/02 23:47:05 by areggie           #+#    #+#             */
/*   Updated: 2021/10/03 19:22:40 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=fk4YTLsnKmw

*/

/*
Динамический массив с++ пример. 
Создание, заполнение, удаление, 
размер динамического массива. 
#55
*/

/*
https://www.youtube.com/watch?v=UhiG8c7hmIA&t=1162s
cоздание двумерного массива
*/

/*
Этот урок к 04day of cpp
*/