/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1002-2Poverh_GlubokoeKopirovanie.cpp               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/02 23:56:22 by areggie           #+#    #+#             */
/*   Updated: 2021/10/03 00:01:04 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/*
https://ravesli.com/urok-145-poverhnostnoe-i-glubokoe-kopirovanie/

*/

/*
Урок №145. Поверхностное и глубокое копирование


*/

/*
Этот урок к 04day of cpp
*/