/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1002Rombovidnoe_nasledovanie.cpp                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/02 23:31:25 by areggie           #+#    #+#             */
/*   Updated: 2021/10/02 23:36:15 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=oqpx7L5ipbw
лекция на Simple Code 114
DiamondTrap или Алмаз Смерти
*/

/*
Виртуальное наследование c++. 
Ромбовидное наследование c++.
Изучение С++ для начинающих. 
Урок #114
*/

/*
Этот урок к 03day of cpp
*/