/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   0930-2SpisokInic_sample.cpp                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/09/30 20:23:48 by areggie           #+#    #+#             */
/*   Updated: 2021/09/30 20:44:34 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//продолжение из файла 0930-1SpisokInicializacii.cpp

#include <iostream>

class Values
{
private:
    int m_value1;
    double m_value2;
    char m_value3;
 
public:
    Values() : m_value1(3), m_value2(4.5), m_value3('d') 
	// напрямую инициализируем переменные-члены класса
    {
    // Нет необходимости использовать присваивание
    }
 
    void print()
    {
         std::cout << "Values(" << m_value1 << ", " << m_value2 << ", " << m_value3 << ")\n";
    }
};
 
int main()
{
    Values value;
    value.print();
    return 0;
}

/*
Больше не нужно выполнять операции присваивания в теле конструктора.
Также обратите внимание, что список инициализации членов не заканчивается точкой с запятой.
*/