/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211009-0ErrorTypes.cpp                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/09 23:57:14 by areggie           #+#    #+#             */
/*   Updated: 2021/10/10 00:34:11 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=Z2GInMb0lVw
Лекция без номера


*/

/*
Три типа ошибок программирования в любом языке. 
Типичные ошибки программистов.
*/

/*
Этот урок к CPP day05
Косвенное отношение
Первый тип:
Ошибки новичков (забытые скобки и тд)

Второй тип:
Ошибки, непредусмотренные логикой программера().
Здесь можно использовать (Try and Catch).

Третий тип:
Программер забыл по невнимательности вписать нужный символ, хотя прога компилится

*/