/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211010-1ThrowYourException.cpp                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 18:03:26 by areggie           #+#    #+#             */
/*   Updated: 2021/10/10 18:04:27 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*

https://www.youtube.com/watch?v=wCUl7yTHWq8
лекция на Simple Code 123

*/

/*
Несколько блоков catch. 
Обработка исключений С++. 
Изучение С++ для начинающих. 
Урок #123
*/

/*
Этот урок к CPP day05
В продолжение лекции 120, 121, 122 о Try and Catch
*/

