/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211009-2Throw.cpp                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 00:33:48 by areggie           #+#    #+#             */
/*   Updated: 2021/10/10 00:35:09 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=FhlGFJ_zdKM
Throw
лекция на Simple Code 121

*/

/*
Генерация исключений с++ пример. 
throw c++ пример. 
Изучение С++ для начинающих. 
Урок #121
*/

/*
Этот урок к CPP day05

В продолжение лекции 120 о Try and Catch
*/