/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211010-0Many_Throws_Catches.cpp                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 17:40:54 by areggie           #+#    #+#             */
/*   Updated: 2021/10/10 17:44:46 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*

https://www.youtube.com/watch?v=guLK7Up6Kmc

лекция на Simple Code 122
*/

/*
Несколько блоков catch. 
Обработка исключений С++. 
Изучение С++ для начинающих. 
Урок #122
*/

/*
Этот урок к CPP day05

В продолжение лекции 120, 121 о Try and Catch
*/