/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211009-1Try_Catch.cpp                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/10 00:19:29 by areggie           #+#    #+#             */
/*   Updated: 2021/10/10 00:22:00 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=jCW2wRoRi0U
лекция на Simple Code 120

*/

/*
С++ try catch. Обработка исключений С++. 
try catch что это. Изучение С++ для начинающих.
Урок #120
*/

/*
Этот урок к CPP day05
Прямое отношение к обработке второго типа ошибок

Второй тип:
Ошибки, непредусмотренные логикой программера().
Здесь можно использовать (Try and Catch).
*/