/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211112SmartPointer.cpp                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/12 17:48:40 by areggie           #+#    #+#             */
/*   Updated: 2021/11/12 17:52:07 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Smart pointer Умный указатель или Мусорсборщик (как в Java)

источник кода https://www.youtube.com/watch?v=ixsTu-ULh0Q&list=PLQOaTSbfxUtCrKs0nicOg2npJQYSPGO9r&index=155
В коде реализуется простейший SmartPointer Код напишу позже


Лекция на Smple Code
Умные указатели. Smart pointers. Изучение С++ для начинающих. Урок #130

Суть: выделение памяти под указатель который сам автоматически зачистится после завершения программы

*/