/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   211117STL.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/17 22:02:28 by areggie           #+#    #+#             */
/*   Updated: 2021/11/17 22:04:46 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.cplusplus.com/reference/stl/

Выше есть папка с реализацией стандартного контейнера в плюсах:
211112ContainerClass

https://en.wikipedia.org/wiki/C%2B%2B_Standard_Library#Containers
*/