/*
https://www.youtube.com/watch?v=sLQLUed6izY&list=PLQOaTSbfxUtBm7DxblJZShqBQnBAVzlXX&index=8

Перегрузка конструкторов класса. 
Что такое перегрузка. 
Как перегрузить конструктор. 
Урок#79


По сути реализация метода констуртор с разными параметрами (очень похоже на перегрузку методов)

Можно создавать множество конструкторов которые могут принимать разное количество переменных
Это хорошо для разных вариантов объектов (которые могут принимать разные переменные)
Компилятор сам будет выбирать нужный вариант

Дефолтный конструктор (тот что ничего не принимает) если не прописан то вызывается автоматически

Можно дефолтный прописывать явно 

*/