/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   D01Ex04-8_211205StringConclusion.cpp               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/05 17:58:18 by areggie           #+#    #+#             */
/*   Updated: 2021/12/05 18:03:49 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//https://www.cplusplus.com/reference/istream/istream/getline/

/*
Std::string это класс который имеет много методов для манипуляции со строкой
Они описаны в мануале https://www.cplusplus.com/reference/string/string/
Иногда для удобства манипуляций со строкой вводят .c_str() чтобы можно
было принимать в параметры с-подобных функций

*/

