/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   D04Ex01_211004ReshenieDeepCopyConstructor.c        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/02 23:56:22 by areggie           #+#    #+#             */
/*   Updated: 2021/12/11 20:38:48 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
https://www.youtube.com/watch?v=3x9nd6Tm7Pc&t=803s (c 16 или 18 мин и дальше объясняется ГЛУБОКОЕ КОПИРОВАНИЕ)
(с 23 мин поясняется как правильно сделать новый указатель на выделенный массив)

Конструктор копирования. Что это. Пример. 
Когда вызывается Копирование объектов по умолчанию C++ #82
*/

/*
На SimpleCode описывается решение проблемы ПОВЕРХНОСТНОГО КОПИРОВАНИЯ если есть выделение памяти на куче
(Корнем этой проблемы является поверхностное копирование, 
выполняемое конструктором копирования по умолчанию.
Такое копирование почти всегда приводит к проблемам.
РЕШЕНИЕ: ВЫПОЛНЕНИЕ ГЛУБОКОГО КОПИРОВАНИЯ (см видео урока))

Это видео - описание решения проблемы которая описана на сайте RAVESLI
https://ravesli.com/urok-145-poverhnostnoe-i-glubokoe-kopirovanie/
Урок №145. Поверхностное и глубокое копирование
*/

/*
Материал к ex01 of Day04 of CPP
Копирование Cat or Dog with Brain dynamic array

*/

/*

НУЖНО прописать код из SimpleCode

*/
