/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   room.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: areggie <areggie@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/28 20:09:06 by areggie           #+#    #+#             */
/*   Updated: 2022/05/28 20:09:39 by areggie          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
	Программы для практики с классами
	https://www.programiz.com/cpp-programming/object-class
*/